<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px">

# Working With Time Series Data

---

### Learning Objectives
 
**After this lesson, you will be able to:**
- Identify time series data.
- Explain the challenges of working with time series data.
- Use the `datetime` library to represent dates as objects.
- Preprocess time series data with Pandas.

---

### Lesson Guide

#### Time Series Data
- [What is a Time Series](#A)
- [The Datetime Library](#B)
- [Preprocessing Time Series Data with Pandas](#C)
- [Independent Practice](#D)
----

<h2><a id="A">What is a Time Series?</a></h2>

A **time series** is a series of data points that's indexed (or listed, or graphed) in time order. Most commonly, a time series is a sequence that's taken at successive equally spaced points in time. Time series are often represented as a set of observations that have a time-bound relation, which is represented as an index.

Time series are commonly found in sales, analysis, stock market trends, economic phenomena, and social science problems.

These data sets are often investigated to evaluate the long-term trends, forecast the future, or perform some other form of analysis.

> **Check for Understanding:** List some examples of real-world time series data.

### Let's take a look at some Apple stock data to get a feel for what time series data look like.

In [1]:
import pandas as pd
from datetime import timedelta
import numpy as np
import matplotlib.pyplot as plt

%matplotlib inline

aapl = pd.read_csv("data/aapl.csv", parse_dates=['Date'])
# Or use aapl['Date'] = pd.to_datetime(aapl['Date'])

Take a high-level look at the data. What are we looking at?

    - Date column of trading dates when measurements taken, starting from 2016-01-19 
    - Open column showing stock price at opening of trading day (US dollars)
    - High column showing maximum stock price of trading day 
    - Low column showing minimum stock price of trading day
    - Close column showing stock price at close of trading day
    - Volume column shows total number of shares traded throughout the trading day

In [2]:
aapl.head()

        Date    Open    High     Low   Close    Volume
0 2017-01-13  119.11  119.62  118.81  119.04  26111948
1 2017-01-12  118.90  119.30  118.21  119.25  27086220
2 2017-01-11  118.74  119.93  118.60  119.75  27588593
3 2017-01-10  118.77  119.38  118.30  119.11  24462051
4 2017-01-09  117.95  119.43  117.94  118.99  33561948

In [3]:
aapl.dtypes

Date      datetime64[ns]
Open             float64
High             float64
Low              float64
Close            float64
Volume             int64
dtype: object

In [9]:
aapl.describe()

TypeError: Cannot interpret '<attribute 'dtype' of 'numpy.generic' objects>' as a data type

In [5]:
aapl['Date'].min()

Timestamp('2016-01-19 00:00:00')

In [6]:
print(np.__version__)

1.21.5

In [7]:
!pip3 install numpy --upgrade

Collecting numpy
  Downloading https://files.pythonhosted.org/packages/61/e6/cba9f64659405fd2236926d934d5f9a83f0e654b3838c5bcd3f400547e2c/numpy-1.23.1-cp38-cp38-win32.whl (12.2MB)
Installing collected packages: numpy
Successfully installed numpy-1.23.1

WARNING: You are using pip version 19.2.3, however version 22.1.2 is available.
You should consider upgrading via the 'python -m pip install --upgrade pip' command.

<h2><a id="B">The DateTime library</a></h2>

As time is important to time series data, we will need to interpret these data in the ways that humans interpret them (which is many ways). 

Python's `DateTime` library is great for dealing with time-related data, and Pandas has incorporated this library into its own `datetime` series and objects.

In this lesson, we'll review these data types and learn a little more about each of them:

* `datetime` objects.
* `datetime` series.
* Timestamps.
* `timedelta()`.

### `datetime` Objects

Below, we'll load in the `DateTime` library, which we can use to create a `datetime` object by entering in the different components of the date as arguments.

In [8]:
# The datetime library is something you should already have from Anaconda.
from datetime import datetime

In [9]:
# Let's just set a random datetime — not the end of the world or anything.
lesson_date = datetime(2012, 12, 21, 12, 21, 12, 844089)

The components of the date are accessible via the object's attributes.

In [10]:
print("Micro-Second", lesson_date.microsecond)
print("Second", lesson_date.second)
print("Minute", lesson_date.minute)
print("Hour", lesson_date.hour)
print("Day", lesson_date.day)
print("Month",lesson_date.month)
print("Year", lesson_date.year)

Micro-Second 844089
Second 12
Minute 21
Hour 12
Day 21
Month 12
Year 2012

### `timedelta()`

Suppose we want to add time to or subtract time from a date. Maybe we're using time as an index and want to get everything that happened a week before a specific observation (difference between two times). `timedelta` only works for days, hours, seconds and microseconds, i.e. the largest value will be in days.

We can use a `timedelta` object to shift a `datetime` object. Here's an example:

In [11]:
# Timedeltas represent time as an amount rather than as a fixed position.
offset = timedelta(days=1, seconds=20)

# The timedelta() has attributes that allow us to extract values from it.
print('offset days', offset.days)
print('offset seconds', offset.seconds)
print('offset microseconds', offset.microseconds)

offset days 1
offset seconds 20
offset microseconds 0

`datetime`'s `.now()` function will give you the `datetime` object of this very moment.

In [13]:
now = datetime.now()
print("Like Right Now: ", now)

Like Right Now:  2020-05-06 18:23:14.479175

The current time is particularly useful when using `timedelta()`.

In [10]:
print("Future: ", now + offset)
print("Past: ", now - offset)

Future:  2018-02-22 21:36:32.743402
Past:  2018-02-20 21:35:52.743402

*Note: The largest value a `timedelta()` can hold is days. For instance, you can't say you want your offset to be two years, 44 days, and 12 hours; you have to convert those years to days.*

You can read more about the `timedelta()` category [here](https://docs.python.org/2/library/datetime.html).

### Guided Practice: Apple Stock Data

We can practice using `datetime` functions and objects using Apple stock data.

In [39]:
aapl.head()

        Date    Open    High     Low   Close    Volume
0  13-Jan-17  119.11  119.62  118.81  119.04  26111948
1  12-Jan-17  118.90  119.30  118.21  119.25  27086220
2  11-Jan-17  118.74  119.93  118.60  119.75  27588593
3  10-Jan-17  118.77  119.38  118.30  119.11  24462051
4   9-Jan-17  117.95  119.43  117.94  118.99  33561948

The `Date` column starts off as an object.

In [40]:
aapl.dtypes

Date       object
Open      float64
High      float64
Low       float64
Close     float64
Volume      int64
dtype: object

<h2><a id="C">Preprocessing Time Series Data with Pandas</a><h2>

### Convert time data to a `datetime` object.

Overwrite the original `Date` column with one that's been converted to a `datetime` series.

In [41]:
aapl['Date'] = pd.to_datetime(aapl.Date)

We can see these changes reflected in the `Date` column structure.

In [42]:
aapl.head()

        Date    Open    High     Low   Close    Volume
0 2017-01-13  119.11  119.62  118.81  119.04  26111948
1 2017-01-12  118.90  119.30  118.21  119.25  27086220
2 2017-01-11  118.74  119.93  118.60  119.75  27588593
3 2017-01-10  118.77  119.38  118.30  119.11  24462051
4 2017-01-09  117.95  119.43  117.94  118.99  33561948

We can also see that the `Date` object has changed.

In [43]:
aapl.dtypes

Date      datetime64[ns]
Open             float64
High             float64
Low              float64
Close            float64
Volume             int64
dtype: object

### The `.dt` Attribute (like the `.str` accessor)

Pandas' `datetime` columns have a `.dt` attribute that allows you to access attributes that are specific to dates. For example:

    aapl.Date.dt.day
    aapl.Date.dt.month
    aapl.Date.dt.year
    aapl.Date.dt.weekday_name

And, there are many more!

In [14]:
aapl.Date.dt.weekday_name.head()

0       Friday
1     Thursday
2    Wednesday
3      Tuesday
4       Monday
Name: Date, dtype: object

In [15]:
aapl.Date.dt.dayofyear.head()

0    13
1    12
2    11
3    10
4     9
Name: Date, dtype: int64

Check out the Pandas `.dt` [documentation](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.dt.html) for more information.

### Timestamps

Timestamps are useful objects for comparisons. You can create a timestamp object using the `pd.to_datetime()` function and a string specifying the date. These objects are especially helpful when you need to perform logical filtering with dates.

WATCH OUT! pd.to_datetime usually likes american format (month, day, year). If you use parameter format='%d / %m / %Y'

In [16]:
ts = pd.to_datetime('1/1/2017')
ts

Timestamp('2017-01-01 00:00:00')

The main difference between a `datetime` object and a timestamp is that timestamps can be used as comparisons or filters.

Let's use the timestamp `ts` as a comparison with our Apple stock data.

In [19]:
aapl.loc[aapl.Date >= ts, :].head()

        Date    Open    High     Low   Close    Volume
0 2017-01-13  119.11  119.62  118.81  119.04  26111948
1 2017-01-12  118.90  119.30  118.21  119.25  27086220
2 2017-01-11  118.74  119.93  118.60  119.75  27588593
3 2017-01-10  118.77  119.38  118.30  119.11  24462051
4 2017-01-09  117.95  119.43  117.94  118.99  33561948

We can even get the first and last dates from a time series.

In [18]:
aapl.Date.max() - aapl.Date.min()

Timedelta('360 days 00:00:00')

> **Check for Understanding:** Why do we convert the DataFrame column containing the time information into a `datetime` object?

### Set `datetime` to Index the DataFrame

After converting the column containing time data from object to `datetime`, it is also useful to make the index of the DataFrame a `datetime`. If you set the index and sort by the index, it can be much faster.

In [49]:
aapl.head()

        Date    Open    High     Low   Close    Volume
0 2017-01-13  119.11  119.62  118.81  119.04  26111948
1 2017-01-12  118.90  119.30  118.21  119.25  27086220
2 2017-01-11  118.74  119.93  118.60  119.75  27588593
3 2017-01-10  118.77  119.38  118.30  119.11  24462051
4 2017-01-09  117.95  119.43  117.94  118.99  33561948

Let's set the `Date` column as the index.

In [4]:
aapl.set_index('Date', inplace=True)

In [51]:
aapl.head()

              Open    High     Low   Close    Volume
Date
2017-01-13  119.11  119.62  118.81  119.04  26111948
2017-01-12  118.90  119.30  118.21  119.25  27086220
2017-01-11  118.74  119.93  118.60  119.75  27588593
2017-01-10  118.77  119.38  118.30  119.11  24462051
2017-01-09  117.95  119.43  117.94  118.99  33561948

In [41]:
aapl[aapl.index < 2016]

          Date    Open    High     Low   Close    Volume
0   2017-01-13  119.11  119.62  118.81  119.04  26111948
1   2017-01-12  118.90  119.30  118.21  119.25  27086220
2   2017-01-11  118.74  119.93  118.60  119.75  27588593
3   2017-01-10  118.77  119.38  118.30  119.11  24462051
4   2017-01-09  117.95  119.43  117.94  118.99  33561948
..         ...     ...     ...     ...     ...       ...
246 2016-01-25  101.52  101.53   99.21   99.44  51196375
247 2016-01-22   98.63  101.46   98.37  101.42  65562769
248 2016-01-21   97.06   97.88   94.94   96.30  52054521
249 2016-01-20   95.10   98.19   93.42   96.79  72008265
250 2016-01-19   98.41   98.65   95.50   96.66  52841349

[251 rows x 6 columns]

### Filtering by Date with Pandas

It is easy to filter by date using Pandas. Let's create a subset of data containing only the stock prices from 2017. We can specify the index as a string constant.

In [53]:
aapl['2017']

              Open    High     Low   Close    Volume
Date
2017-01-13  119.11  119.62  118.81  119.04  26111948
2017-01-12  118.90  119.30  118.21  119.25  27086220
2017-01-11  118.74  119.93  118.60  119.75  27588593
2017-01-10  118.77  119.38  118.30  119.11  24462051
2017-01-09  117.95  119.43  117.94  118.99  33561948
2017-01-06  116.78  118.16  116.47  117.91  31751900
2017-01-05  115.92  116.86  115.81  116.61  22193587
2017-01-04  115.85  116.51  115.75  116.02  21118116
2017-01-03  115.80  116.33  114.76  116.15  28781865

There are a few things to note about indexing with time series. Unlike numeric indexing, the end index will be included. If you want to index with a range, the time indices must be sorted first.

> **Recap:** The steps for preprocessing time series data are to:
* Convert time data to a `datetime` object.
* Set `datetime` to index the DataFrame.

# Recap

* We use time series analysis to identify changes in values over time.
* The `datetime` library makes working with time data more convenient.
* To preprocess time series data with Pandas, you:
    1. Convert the time column to a `datetime` object.
    2. Set the time column as the index of the DataFrame.

<h2><a id="D">Independent Practice</a></h2>

**Instructor Note**: These are optional and can be assigned as student practice questions outside of class.

### 1) Create a `datetime` object representing today's date.

In [25]:
today_date = datetime(2020, 5, 6)

In [26]:
print(today_date.year)
print(today_date.month)
print(today_date.day)

2020
5
6

### 2) Load the UFO data set from the internet.

In [51]:
import pandas as pd
from datetime import timedelta
%matplotlib inline

ufo = pd.read_csv('http://bit.ly/uforeports')

In [52]:
ufo.head()
ufo.dtypes

City               object
Colors Reported    object
Shape Reported     object
State              object
Time               object
dtype: object

### 3) Convert the `Time` column to a `datetime` object.

In [53]:
ufo['Time'] = pd.to_datetime(ufo.Time)

In [54]:
ufo.dtypes

City                       object
Colors Reported            object
Shape Reported             object
State                      object
Time               datetime64[ns]
dtype: object

### 4) Set the `Time` column to the index of the dataframe.

In [67]:
# Without inplace=True, you won't be able to index 
ufo.set_index('Time', inplace=True)

### 5) Create a `timestamp` object for the date January 1, 1999.

In [68]:
time_filter = pd.Timestamp(1999, 1, 1, 12)

### 6) Use the `timestamp` object to perform logical filtering on the DataFrame and create a subset of entries with a date above or equal to January 1, 1999.

In [69]:
ufo.loc[ufo.index < time_filter]

                                     City Colors Reported Shape Reported State
Time
1930-06-01 22:00:00                Ithaca             NaN       TRIANGLE    NY
1930-06-30 20:00:00           Willingboro             NaN          OTHER    NJ
1931-02-15 14:00:00               Holyoke             NaN           OVAL    CO
1931-06-01 13:00:00               Abilene             NaN           DISK    KS
1933-04-18 19:00:00  New York Worlds Fair             NaN          LIGHT    NY
...                                   ...             ...            ...   ...
1998-12-31 23:00:00             Jonesboro             NaN        VARIOUS    LA
1998-12-31 23:30:00           Burnt Hills          ORANGE          LIGHT    NY
1998-12-31 23:59:00              Appleton             NaN       TEARDROP    WI
1999-01-01 02:30:00             Loma Rica             NaN          LIGHT    CA
1999-01-01 03:00:00               Bauxite             NaN            NaN    AR

[12834 rows x 4 columns]

In [70]:
ufo[ufo.index > time_filter]

                                  City Colors Reported Shape Reported State
Time
1999-01-01 14:00:00           Florence             NaN       CYLINDER    SC
1999-01-01 15:00:00       Lake Henshaw             NaN          CIGAR    CA
1999-01-01 17:15:00  Wilmington Island             NaN          LIGHT    GA
1999-01-01 18:00:00             DeWitt             NaN          LIGHT    AR
1999-01-01 19:12:00  Bainbridge Island             NaN            NaN    WA
...                                ...             ...            ...   ...
2000-12-31 23:00:00         Grant Park             NaN       TRIANGLE    IL
2000-12-31 23:00:00        Spirit Lake             NaN           DISK    IA
2000-12-31 23:45:00        Eagle River             NaN            NaN    WI
2000-12-31 23:45:00        Eagle River             RED          LIGHT    WI
2000-12-31 23:59:00               Ybor             NaN           OVAL    FL

[5407 rows x 4 columns]

In [71]:
# Slicing on a time series object
ufo[time_filter:]

                                  City Colors Reported Shape Reported State
Time
1999-01-01 14:00:00           Florence             NaN       CYLINDER    SC
1999-01-01 15:00:00       Lake Henshaw             NaN          CIGAR    CA
1999-01-01 17:15:00  Wilmington Island             NaN          LIGHT    GA
1999-01-01 18:00:00             DeWitt             NaN          LIGHT    AR
1999-01-01 19:12:00  Bainbridge Island             NaN            NaN    WA
...                                ...             ...            ...   ...
2000-12-31 23:00:00         Grant Park             NaN       TRIANGLE    IL
2000-12-31 23:00:00        Spirit Lake             NaN           DISK    IA
2000-12-31 23:45:00        Eagle River             NaN            NaN    WI
2000-12-31 23:45:00        Eagle River             RED          LIGHT    WI
2000-12-31 23:59:00               Ybor             NaN           OVAL    FL

[5407 rows x 4 columns]